pmo-dataset/mermaid/26.mmd
graph LR
	classDef endEvent stroke-width:4px
	
	Manual_3["notify social\nsecurity"] --> ParallelGateway_2{"+"}
	Manual_2["notify employer"] --> ParallelGateway_2
	ParallelGateway_2 --> Service_1["receive confirmation\nfrom employer"]
	Manual_5["do\nmaternity/paternity\nleave"] --> Manual_6["decide if extend\nleave or return to\nwork"]
	Manual_6 --> ExclusiveGateway_1{"X"}
	ExclusiveGateway_1 --> EndNoneEvent_1(("return to job")):::endEvent
	StartNoneEvent_1((" ")) --> ParallelGateway_3{"+"}
	ParallelGateway_3 --> Service_3["fetch information\nabout financial\nsupport"]
	ParallelGateway_3 --> Service_2["fetch information\nabout leave models"]
	Service_3 --> ParallelGateway_4{"+"}
	Service_2 --> ParallelGateway_4
	ParallelGateway_4 --> Manual_1["select appropriate\nmodel"]
	ExclusiveGateway_2{"X"} --> Manual_7["apply for financial\nsupport"]
	Manual_7 --> ExclusiveGateway_3{"X"}
	Manual_8["decide if apply for\nfinancial support"] --> ExclusiveGateway_2
	ExclusiveGateway_2 --> ExclusiveGateway_3
	Service_1 --> Service_4["check if all\nnecessary documents\ngathered"]
	Service_4 --> ExclusiveGateway_4{"X"}
	ExclusiveGateway_4 --> Manual_5
	ParallelGateway_1{"+"} --> Manual_2
	ParallelGateway_1 --> Manual_3
	ExclusiveGateway_4 --> Manual_4["prepare necessary\ndocuments for leave"]
	ExclusiveGateway_3 --> Manual_4
	Manual_4 --> ParallelGateway_1
	Manual_1 --> Manual_8
	ExclusiveGateway_1 --> Manual_4
