pmo-dataset/variations/graphviz_with_ids/26.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "Service_1" [label="receive confirmation\nfrom employer"];
  "Service_2" [label="fetch information\nabout leave models"];
  "Service_3" [label="fetch information\nabout financial\nsupport"];
  "Service_4" [label="check if all\nnecessary documents\ngathered"];
  "Manual_1" [label="select appropriate\nmodel"];
  "Manual_2" [label="notify employer"];
  "Manual_3" [label="notify social\nsecurity"];
  "Manual_4" [label="prepare necessary\ndocuments for leave"];
  "Manual_5" [label="do\nmaternity/paternity\nleave"];
  "Manual_6" [label="decide if extend\nleave or return to\nwork"];
  "Manual_7" [label="apply for financial\nsupport"];
  "Manual_8" [label="decide if apply for\nfinancial support"];
  "StartNoneEvent_1" [shape=circle, label=""];
  "EndNoneEvent_1" [shape=circle, penwidth=4, label="return to job"];
  "ExclusiveGateway_1" [shape=diamond, label="X"];
  "ExclusiveGateway_2" [shape=diamond, label="X"];
  "ExclusiveGateway_3" [shape=diamond, label="X"];
  "ExclusiveGateway_4" [shape=diamond, label="X"];
  "ParallelGateway_1" [shape=diamond, label="+"];
  "ParallelGateway_2" [shape=diamond, label="+"];
  "ParallelGateway_3" [shape=diamond, label="+"];
  "ParallelGateway_4" [shape=diamond, label="+"];

  "Manual_3" -> "ParallelGateway_2";
  "Manual_2" -> "ParallelGateway_2";
  "ParallelGateway_2" -> "Service_1";
  "Manual_5" -> "Manual_6";
  "Manual_6" -> "ExclusiveGateway_1";
  "ExclusiveGateway_1" -> "EndNoneEvent_1";
  "StartNoneEvent_1" -> "ParallelGateway_3";
  "ParallelGateway_3" -> "Service_3";
  "ParallelGateway_3" -> "Service_2";
  "Service_3" -> "ParallelGateway_4";
  "Service_2" -> "ParallelGateway_4";
  "ParallelGateway_4" -> "Manual_1";
  "ExclusiveGateway_2" -> "Manual_7";
  "Manual_7" -> "ExclusiveGateway_3";
  "Manual_8" -> "ExclusiveGateway_2";
  "ExclusiveGateway_2" -> "ExclusiveGateway_3";
  "Service_1" -> "Service_4";
  "Service_4" -> "ExclusiveGateway_4";
  "ExclusiveGateway_4" -> "Manual_5";
  "ParallelGateway_1" -> "Manual_2";
  "ParallelGateway_1" -> "Manual_3";
  "ExclusiveGateway_4" -> "Manual_4";
  "ExclusiveGateway_3" -> "Manual_4";
  "Manual_4" -> "ParallelGateway_1";
  "Manual_1" -> "Manual_8";
  "ExclusiveGateway_1" -> "Manual_4";
}
